lecture02/simulations/02TJunctionGasWithBaffleMembrane/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{

    membrane
    {
        type        faceZone;
        zoneName    membrane;

        owner
        {
            name        membraneLeft;
            type        mappedWall;
            neighbourPatch membraneRight;
        }

        neighbour
        {
            name        membraneRight;
            type        mappedWall;
            neighbourPatch membraneLeft;
        }   
    }

}


// ************************************************************************* //
