lecture02/simulations/02TJunctionGasWithBaffleMembrane/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue CH4 0.0
    //volScalarFieldValue CO2 0.0
    //volScalarFieldValue N2  1.0
    
);

regions
(
    zoneToCell
    {
        zone permeate;
        fieldValues
        (
        
            //volScalarFieldValue CH4 1e-4
            volScalarFieldValue CO2 1.e-10
            //volScalarFieldValue N2  1.0       

        );
    }
);


// ************************************************************************* //
